### 데이터 집합 불러오기
- read_csv('경로/파일명',sep='\t',encoding='utf8)

        - 기본적으로 쉽표(,)로 열이 구분되어 있는 데이터를 불러옴
        - 쉼표가 아닌 구분자 사용 시 sep 옵션 사용

In [8]:
import pandas as pd

df = pd.read_csv('C:/Study/Study_Python2/Pandas 실습/gapminder.tsv', sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [12]:

df1 = pd.read_csv('C:/Study/Study_Python2/Numpy 실습/data.csv', header=None)
df1

      0     1     2     3     4
0   1.0   2.0   3.0   4.0   5.0
1   6.0   7.0   8.0   9.0  10.0
2  11.0  12.0  13.0  14.0  15.0
3  16.0  17.0  18.0  19.0  20.0
4  21.0  22.0  23.0  24.0  25.0

In [16]:
df2= pd.read_csv('C:/Study/Study_Python2/Pandas 실습/ex1_지역별전기요금_2.csv', encoding='EUC-KR')
df2

    지역      가구수  전력량     금액
0    1   565082  273  27177
1    2  2827233  444  45111
2    3  1144913  289  29043
3    4  1131034  230  22436
4    5   380425  391  38020
5    6   668623  364  35245
6    7   425659  344  32331
7    8   947300  366  36274
8    9  2737725  361  36569
9   10    49394  580  57091
10  11   323151  353  35470
11  12   734723  398  40049
12  13   726699  249  25120
13  14   634696  285  28556
14  15   258605  221  22180
15  16   742285  282  27901
16  17   584500  268  26899

head(n)
- 데이터프레임의 데이터를 확인한는

In [18]:
df.head(10)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
7  Afghanistan      Asia  1987   40.822  13867957  852.395945
8  Afghanistan      Asia  1992   41.674  16317921  649.341395
9  Afghanistan      Asia  1997   41.763  22227415  635.341351

type()
- 자료형 확인

In [22]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

shape
- 데이터의 행과 열의 크기 정보

In [23]:
print(df.shape)

(1704, 6)

columns
- 데이터프레임의 열 이름 정보

In [24]:
print(df.columns)

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

dtypes
- 데이터프레임의 모든 열 자료형 확인

In [25]:
print(df.dtypes)

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

info()
- 데이터프레임의 상세 정보 확인

In [27]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB
None

### 데이터 추출하기
- 열단위 데이터 추출하기 -> 시리즈

dif['열이름']

In [28]:
country_df = df['country']
print(type(country_df))

<class 'pandas.core.series.Series'>

tail(n)

    - 데이터프레임의 데이터를 확인하는 용도로 사용
    - 가장 뒤에 있는 5개의 행을 출력(n 숫자 지정시 개수만큼 출력)

In [ ]:
df.tail()

- 여러개의 열 데이터 추출하기 -> 데이터프레임

df[['열1 이름','열2 이름','열3 이름'...'열n 이름']]

In [29]:
subset = df[['country', 'continent', 'year']]
print(type(subset))

print(subset.tail())

<class 'pandas.core.frame.DataFrame'>
       country continent  year
1699  Zimbabwe    Africa  1987
1700  Zimbabwe    Africa  1992
1701  Zimbabwe    Africa  1997
1702  Zimbabwe    Africa  2002
1703  Zimbabwe    Africa  2007

- 행 단위 데이터 추출하기

    - loc : 인덱스를 기준으로 행 데이터 추출
    - iloc : 행 번호를 기준으로 행 데이터 추출